docs/diagrams.md
```mermaid
flowchart LR
    User[Usuário] --> FE[Front-end React]

    FE -->|HTTP/JSON| BE[Back-end Flask API]

    BE --> DB[(Banco de Dados)]
    BE --> IMG[Serviço de Imagens]
    FE --> MAP[API de Mapas]

    IMG -->|URL| BE
    
```
