docs/diagrams.md
```mermaid
flowchart TD
    App --> AuthContext
    App --> Pages

    Pages --> Login
    Pages --> Cadastro
    Pages --> Feed
    Pages --> CriarPost
    Pages --> Perfil

    Feed --> PetCard
    CriarPost --> UploadImage
    Feed --> MapView

    App --> API[api.js]
    
```
