docs/diagrams.md
```mermaid
flowchart TD
    Routes --> Controllers
    Controllers --> Services
    Services --> Models
    Models --> DB[(Banco de Dados)]

    Services --> External[Serviços Externos]
    
```
