docs/diagrams.md
```mermaid
erDiagram
    USER {
        int id
        string nome
        string email
        string senha
        string telefone
    }

    PET {
        int id
        string nome
        string tipo
        string descricao
        string status
        date data
        float latitude
        float longitude
        int user_id
    }

    IMAGE {
        int id
        string url
        int pet_id
    }

    USER ||--o{ PET : possui
    PET ||--o{ IMAGE : tem
    
```
